gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		mag = MagS_x_mag;
		faseS_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseS_x_mag += (float)-0.1010751752*mag*mag;
		faseS_x_mag += (float)0.0096132710*mag*mag*mag;

		mag = MagT_x_mag;
		faseT_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseT_x_mag += (float)-0.1010751752*mag*mag;
		faseT_x_mag += (float)0.0096132710*mag*mag*mag;

		// FREQUENCIA
		//correcao de fase em funcao da frequencia
		mag = media_freq;
		faseR_x_freq = (float)0.0237760101*mag-(float)1.1727874302;
		faseS_x_freq = (float)0.0237760101*mag-(float)1.1727874302;
		faseT_x_freq = (float)0.0237760101*mag-(float)1.1727874302;



		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;
		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;
		MagR_x_freq = mag*((float)-3.6463158287E-5)+(float)0.0011139213;


		// Calcula magnitude final
		// Ajustes da magnitude:

		// Sensor PRETO:
		Mag_R_final = MagR_x_mag * 64.727;
		Mag_S_final = MagS_x_mag * 65.105;
		Mag_T_final = MagT_x_mag * 64.596;


		//Calcula fase final (aplica as correcoes anteriores)
		Fase_R_final = Fase_R+faseR_x_mag+faseR_x_freq;
		Fase_S_final = Fase_S+faseS_x_mag+faseS_x_freq;
		Fase_T_final = Fase_T+faseT_x_mag+faseT_x_freq;


		// Correcao da regiao de 180 graus para a fase final
		if(Fase_R_final > 180.0){
			Fase_R_final = (Fase_R_final-360);
		}
		if(Fase_R_final <= -180.0){
			Fase_R_final = (Fase_R_final+360);
		}
		if(Fase_S_final>180.0){
			Fase_S_final = (Fase_S_final-360);
		}
		if(Fase_S_final<= -180.0){
			Fase_S_final = (Fase_S_final+360);
		}
		if(Fase_T_final>180.0){
			Fase_T_final = (Fase_T_final-360);
		}
		if(Fase_T_final<= -180.0){
			Fase_T_final = (Fase_T_final+360);
		}

		  // DADOS DA TRANSMISSAO (via serial pro PC)
		buffer[0] = Mag_R_final;
		buffer[1] = Fase_R_final;//_final;
		buffer[2] = Freq_final;
		buffer[3] = media_rocof;

		// Envia os dados pela serial
		uint8_t *dados = (uint8_t*)&buffer;
		UARTPutString(dados,36);

		#endif


		if((isSyncCreated == 1) && (data_flag)){
				cnt = 0;
				osSemaphoreRelease(syncSem_id);

		}
		BSP_LED_Toggle(LED1);

	}
}




extern xSemaphoreHandle sUART;
char teste;

void GPS_Task(void const * argument)
{

	osMessageQDef(SerialGPSq, 128, unsigned char);
	SerialGPSq = osMessageCreate(osMessageQ(SerialGPSq), NULL);


	sUART = xSemaphoreCreateBinary();
	MX_USART6_UART_Init();
	HAL_UART_Receive_IT(&huart6, (uint8_t*)&teste, 1);

	while(1){
	    volatile unsigned char *p;

		p = (unsigned char*)&dado_gps;

		do{
			UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		  }while(*p != '$');

		p--;

		do{
		   p++;
		   UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		}while(*p != '\n');

		/*Verifica se chegou informações de Data e Hora*/
		if (dado_gps[0] == 'G' && dado_gps[1] == 'P' && dado_gps[2] == 'R' &&
				dado_gps[3] == 'M' && dado_gps[4] == 'C'){

			struct tm t;

			t.tm_hour = 10*(dado_gps[6]-48) + (dado_gps[7]-48);
			t.tm_min = 10*(dado_gps[8]-48) + (dado_gps[9]-48);
			t.tm_sec = 10*(dado_gps[10]-48) + (dado_gps[11]-48);
			t.tm_mday = 10*(dado_gps[52]-48) + (dado_gps[53]-48);
			t.tm_mon = 10*(dado_gps[54]-48) + (dado_gps[55]-48)-1;
			t.tm_year = 2000+10*(dado_gps[56]-48) + (dado_gps[57]-48) - 1900;
			t.tm_isdst = -1;

			//char m[80];
			//sprintf(m, "%d:%d:%d - %d/%d/%d\n", t.tm_hour, t.tm_min, t.tm_sec,
			//		                            t.tm_mday, t.tm_mon+1, t.tm_year+1900 );
			//EwPrint(m);

			/*segundo secular UNIX time (1 jan 1970)*/
			SOC = (unsigned long) mktime(&t);

			/*Novo SOC foi calculado*/
			newSOC = 1;

		//	sprintf(m, "SOC %d\n", (int)SOC);
		//	EwPrint(m);

			a=0; //Pra zerar o contador do FracSec
		}
	}
}

void UARTGetChar(UART_HandleTypeDef *huart, unsigned char *data, int timeout)
{
	osEvent event;

	if (huart->Instance == USART6)
	{
		event = osMessageGet(SerialGPSq, timeout);
		if(event.status == osEventMessage){
			*data = (unsigned char)event.value.v;
		}
	}

}


//////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//						FORMATAÇÃO DOS DADOS
//

// IEEE Std C37.118.2 - 2011 - PMU Standard data transfer

// SYNC[1] Second byte
// bit[7] = Reserved
// bits[6,5,4] = Frame Type, bits[3,2,1,0]

#define A_SYNC_AA 0xAA
#define A_SYNC_DATA 0x01
#define A_SYNC_HDR 0x11
#define A_SYNC_CFG1 0x21
#define A_SYNC_CFG2 0x31
#define A_SYNC_CFG3 0x52
#define A_SYNC_CMD 0x41

// IMPLEMENTAÇÃO DO CRC-CCITT
// Baseado na norma

uint16_t CRC_CCITT;

uint16_t ComputeCRC(unsigned char *Message, unsigned char MessLen)
{
	uint16_t crc=0xFFFF;
	uint16_t temp;
	uint16_t quick;
	int i;

	for(i=0;i<MessLen;i++)
	{
		temp = (crc>>8) ^ Message[i];
		crc <<= 8;
		quick = temp ^ (temp >> 4);
		crc ^= quick;
		quick <<=5;
		crc ^= quick;
		quick <<= 7;
		crc ^= quick;
	}
	return crc;
}


unsigned char ucData[128];


unsigned int PmuID = 0x0001;			// Identificacao da PMU





/////////////// FRAME DE DADOS
struct frameDataQueue* qUcData = NULL;
int frame_data(void)
{
	// Se a fila nao existir, cria-la
	if (qUcData == NULL) {
		qUcData = createFDQueue();
	}

	uint8_t i=0;

	memset((void*)ucData, 0, 128);

	// 1. SYNC = Data Message Sync Byte and Frame Type
	ucData[i++] = A_SYNC_AA;   //0
	ucData[i++] = A_SYNC_DATA; //1

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[i++] = (unsigned char)0x00;   //2
	ucData[i++] = (unsigned char)0x32;   //3

	// 3. IDCODE = ID da fonte de transmissao
	ucData[i++] = (unsigned char)((PmuID & 0xFF00) >> 8);   //4
	ucData[i++] = (unsigned char)(PmuID & 0x00FF);   //5

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[i++] = (unsigned char)((SOC & 0xFF000000) >> 24);   //6
	ucData[i++] = (unsigned char)((SOC & 0x00FF0000) >> 16);   //7
	ucData[i++] = (unsigned char)((SOC & 0x0000FF00) >> 8);   //8
	ucData[i++] = (unsigned char)(SOC & 0x000000FF);   //9

	// 5. FRACSEC = Fração do segundo e qualidade do tempo
	ucData[i++] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //10 - Time quality (seção 6.2.2)
	ucData[i++] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //11 - fracsec
	ucData[i++] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //12 - fracsec
	ucData[i++] = (unsigned char)(FracSec & 0x000000FF);		  //13 - fracsec
	FracSec += 0x00008235;
	//frame_cnt++;

	// 6. STAT = Flags, a criterio do usuario
	ucData[i++] = 0x00;   //14
	ucData[i++] = 0x00;   //15

